#### Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2023, 1, 17, 14, 55, 8, 742758)

In [4]:
today_date-datetime.timedelta(2)

datetime.datetime(2023, 1, 15, 14, 55, 8, 742758)

In [5]:
#by using list comprehension to get 15 days datetime data
list_15=[today_date-datetime.timedelta(x) for x in range(1,16)]

In [6]:
list_15

[datetime.datetime(2023, 1, 16, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 15, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 14, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 13, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 12, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 11, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 10, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 9, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 8, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 7, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 6, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 5, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 4, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 3, 14, 55, 8, 742758),
 datetime.datetime(2023, 1, 2, 14, 55, 8, 742758)]

In [7]:
import pandas as pd
data=pd.DataFrame(list_15,columns=['day'])

In [8]:
data.head()

                         day
0 2023-01-16 14:55:08.742758
1 2023-01-15 14:55:08.742758
2 2023-01-14 14:55:08.742758
3 2023-01-13 14:55:08.742758
4 2023-01-12 14:55:08.742758

In [9]:
data['weekday']=data['day'].dt.day_name()

In [10]:
data.head()

                         day   weekday
0 2023-01-16 14:55:08.742758    Monday
1 2023-01-15 14:55:08.742758    Sunday
2 2023-01-14 14:55:08.742758  Saturday
3 2023-01-13 14:55:08.742758    Friday
4 2023-01-12 14:55:08.742758  Thursday

In [11]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [12]:
#map it.
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [13]:
data.head()

                         day   weekday  weekday_ordinal
0 2023-01-16 14:55:08.742758    Monday                1
1 2023-01-15 14:55:08.742758    Sunday                7
2 2023-01-14 14:55:08.742758  Saturday                6
3 2023-01-13 14:55:08.742758    Friday                5
4 2023-01-12 14:55:08.742758  Thursday                4

### Count Or Frequency Encoding

In [14]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)

In [15]:
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       32561 non-null  int64
 1   1       32561 non-null  object
 2   2       32561 non-null  int64
 3   3       32561 non-null  object
 4   4       32561 non-null  int64
 5   5       32561 non-null  object
 6   6       32561 non-null  object
 7   7       32561 non-null  object
 8   8       32561 non-null  object
 9   9       32561 non-null  object
 10  10      32561 non-null  int64
 11  11      32561 non-null  int64
 12  12      32561 non-null  int64
 13  13      32561 non-null  object
 14  14      32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [17]:
#we can take only categorical features
columns=[1,3,5,6,7,8,9,13]

In [18]:
train_set=train_set[columns]

In [20]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [21]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [23]:
#to find out the length of the categories.
for feature in train_set.columns:
    print(feature,':',len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [26]:
#here the country have highest labels
country_map=train_set['Country'].value_counts().to_dict()

In [27]:
#so,we can map with this values to the categorical country feature.
train_set['Country']=train_set['Country'].map(country_map)

In [28]:
train_set.head(10) #the categorical feature of country was filled with their value_counts

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170

### Advantages
1.Easy To Use

2.Not increasing feature space
### Disadvantages
1.It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding
1.Ordering the labels according to the target

2.Replace the labels by the joint probability of being 1 or 0

In [29]:
import pandas as pd
df=pd.read_csv('Titanic-Train-Data.csv',usecols=['Cabin','Survived'])

In [30]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [31]:
#first we fill with NaN value by some new value.
df['Cabin'].fillna('missing',inplace=True)

In [33]:
df.head(10)

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing
5         0  missing
6         0      E46
7         0  missing
8         1  missing
9         1  missing

In [40]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [41]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [45]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index #it gives the values based on the survived.

In [47]:
#by using dictionary comprehension
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)} #enumerate is nothing but a iterable object,the syntax enumearte(iterable,start=0)

In [48]:
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [49]:
#then we can map it
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [50]:
df.head() #then we can drop the cabin feature.

   Survived Cabin  Cabin_ordinal_labels
0         0     m                     1
1         1     C                     4
2         1     m                     1
3         1     C                     4
4         0     m                     1

### mean encoding

In [51]:
#it is also same as target giuided ordinal encoding.
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean()

In [53]:
ordinal_labels.to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [55]:
df['ordinal_labels']=df['Cabin'].map(ordinal_labels)

In [56]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  ordinal_labels
0         0     m                     1        0.299854
1         1     C                     4        0.593220
2         1     m                     1        0.299854
3         1     C                     4        0.593220
4         0     m                     1        0.299854